from random import *

# Список с потеницальными ответами
answers = [
    'Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 
    'Можешь быть уверен в этом', 'Мне кажется - да', 'Вероятнее всего',
    'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно, попробуй снова',
    'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
    'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 
    'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно'
    ]

# Проверка валидности имени пользователя 
def is_valid(name):
    if name.strip() != '':
        return True
    else:
        return False

# Проверка валидности ответа пользователя на вопрос о повторонй игре
def again_game(user_answer):
    if user_answer.lower() in ('да', 'нет'):
        return True
    else:
        return False


# Игра "Магический шар 8"
def magic_ball():
    # Приветствие
    print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')

    # Запрашиваем имя пользователя
    print('Как я могу к Вам обращаться?')
    user_name = input('Введите имя: ')

    # Проверяем имя на валидность
    if is_valid(user_name):
        print(f'Магический шар абсолютно магическим образом угадал твое имя! Тебя зовут {user_name}')
    else:
        while not is_valid(user_name):
            print('В это поле нужно ввести имя. Не пытайся меня запутать ;)')
            print('Как я могу к Вам обращаться?')
            user_name = input('Введите имя: ')
        
        print(f'Магический шар абсолютно магическим образом угадал твое имя! Тебя зовут {user_name}')

    # Основной блок программы - вопрос пользователя и получение рандом ответа
    while True:
        print('')
        print('Какой у тебя вопрос?')
        question = input('Твой вопрос к магическому шару: ')
        print()
        print(f'{user_name}, магический шар приготовил для тебя ответ')
        answer = choice(answers)
        print(f'Его ответ: {answer}')
        print()

        user_answer = input('Остались ли у тебя еще вопросы к магическому шару (Да/Нет)? : ')

        while not again_game(user_answer):
            user_answer = input('Не понимаю твой ответ. Остались ли у тебя еще вопросы к магическому шару (Да/Нет)? : ')

        if user_answer.lower() == 'нет':
            print('Возвращайся, если возникнут вопросы!')
            break

magic_ball()